app/controllers/categories_controller.rb

INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES('fun', '2010-06-25 12:48:11', '2010-06-25 12:48:11')
---
  def create
    @category=Category.new(params[:category])
if @category.save

SELECT * FROM `categories` WHERE (`categories`.`id` = 2)
---
  def edit
     @category=Category.find(params[:id])

SELECT * FROM `categories` WHERE (`categories`.`id` = 2)
UPDATE `categories` SET `updated_at` = '2010-06-25 12:49:37', `name` = 'entertainment' WHERE `id` = 2
---
  def update
    @category=Category.find(params[:id])
  if @category.update_attributes(params[:category])

SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
DELETE FROM `categories` WHERE `id` = 1
---
  def destroy
    @category=Category.find(params[:id])
  if @category.destroy