app/controllers/comments_controller.rb

SELECT * FROM `posts` WHERE (`posts`.`id` = 31)
---
  def index
    @post=Post.find(params[:id])

INSERT INTO `comments` (`name`, `comment`, `created_at`, `updated_at`, `post_id`) VALUES(NULL, NULL, '2010-06-29 06:57:14', '2010-06-29 06:57:14', NULL)
---
 def create
   @comment=Comment.new(params[:comment])
   @comment.post_id=params[:id]
      if @comment.save