app/controllers/home_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 3) LIMIT 1
---
  def index
    @posts=Post.find(:all)
    @users=User.find(:all)