app/controllers/posts_controller.rb

INSERT INTO `posts` (`category`, `created_at`, `image_file_name`, `title`, `image_file_size`, `updated_at`, `image_content_type`, `user_id`, `description`, `image_updated_at`) VALUES('fun', '2010-07-01 09:40:17', NULL, 'test', NULL, '2010-07-01 09:40:17', NULL, 3, 'test', NULL)
---
  def create
    @post=Post.new(params[:post])
    @post.user_id=current_user.id
if @post.save

SELECT * FROM `posts` WHERE (`posts`.`id` = 2)
UPDATE `posts` SET `updated_at` = '2010-06-25 13:42:27', `title` = 'aaaaaaaaaaaaaaaaaaaa', `description` = 'aaaaaaaaaaaaaaaaaaaaaa' WHERE `id` = 2
---
  def update
    @post=Post.find(params[:id])
  if @post.update_attributes(params[:post])

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
DELETE FROM `posts` WHERE `id` = 1
---
  def destroy
     @post=Post.find(params[:id])
  if @post.destroy