app/controllers/replays_controller.rb

SELECT * FROM `comments` WHERE (`comments`.`id` = 11)
---
  def index
    @comment=Comment.find(params[:id])

INSERT INTO `replays` (`created_at`, `updated_at`, `replay`, `comment_id`) VALUES('2010-06-30 14:11:23', '2010-06-30 14:11:23', 'sdfgdfgsdfgsd\r\nfg\r\nsdf\r\ng\r\nsdfg\r\ndf', NULL)
---
  def create
     @replay=Replay.new(params[:replay])
   @replay.comment_id=params[:id]
   if @replay.save