app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `email`) VALUES('', 'bf572606e61e27da07c4d5dc77f8d1a3754e8066', '2010-06-24 14:31:35', '021c61c886721536edf7315d43bd6e71d1282a5e', NULL, '2010-06-24 14:31:35', NULL, 'justin', 'admin@df.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save